Repository: kevinpt/opbasm
Catalog: opbasm_lib/lang/*/LC_MESSAGES/pb_update.po
Languages: de, fr

source: {} -m <MEM file> -n <NCD file> [-l <Layout spec>] [-o <output BIT file>]
de: {} -m <MEM-Datei> -n <NCD-Datei> [-l <Layout-Spezifikation>] [-o <Ausgabe BIT-Datei>]
fr: {} -m <fichier MEM> -n <fichier NCD> [-l <Disposition spec>] [-o <fichier BIT de sortie>]

source: MEM file
de: Fehlende MEM-Datei
fr: Fichier MEM manquant

source: NCD file
de: NCD-Datei
fr: fichier NCD

source: Memory layout specification "inst1,inst2,...instN[:next row...]"
de: Speicherlayout Spezifikation "inst1,inst2,...instN[:nächste Zeile...]"
fr: Disposition de la mémoire spécification "inst1,inst2,...instN [:ligne suivante...]"

source: Output BIT file
de: Ausgabe BIT-Datei
fr: Le fichier de sortie de BIT

source: Missing MEM file
de: Fehlende MEM-Datei
fr: Fichier MEM manquant

source: Missing NCD file
de: Fehlende NCD-Datei
fr: Fichier NCD manquant

source: ERROR:
de: FEHLER:
fr: ERREUR:

source: PicoBlaze ROM updater
fr: PicoBlaze mise à jour de ROM

source: MEM file not found
de: MEM-Datei nicht gefunden
fr: Fichier MEM introuvable

source: NCD file not found
de: NCD-Datei nicht gefunden
fr: Fichier NCD introuvable

source: BIT file not found ({})
de: BIT-Datei nicht gefunden ({})
fr: Fichier BIT non trouvé ({})

source: Running XDL...
de: Führe XDL aus...
fr: XDL exécuter...

source: XDL failure
de: XDL Abbruch
fr: échec XDL

source: XDL file not generated
de: XDL-Datei nicht erzeugt
fr: Fichier XDL pas générée

source: No RAM instances found
de: Keine RAM-Instanzen gefunden
fr: Aucun cas de RAM trouvé

source: Available RAM instances:
de: Verfügbare RAM-Instanzen:
fr: Instances de RAM disponibles:

source: Duplicate instances in BRAM spec
de: Doppelte Instanzen in BRAM Spezifikation
fr: Dupliquer cas dans BRAM spec

source: Instance does not exist in netlist ({})
de: Instanz existiert nicht in Netzliste ({})
fr: Instance ne existe pas dans netlist ({})

source: Required memory depth:
de: Erforderliche Speichertiefe:
fr: Requis profondeur de mémoire:

source: Memory layout:
de: Speicherlayout:
fr: Disposition de la mémoire:

source: No BRAMs remaining
de: Keine BRAMs verbleibenden
fr: Aucun BRAM restants

source: Available RAM instances:
de: Verfügbare RAM-Instanzen:
fr: Instances de RAM disponible:

source: q) Quit
de: q) Beenden
fr: q) Quitter

source: Select RAM instance:
de: Wähle RAM-Instanz:
fr: Sélectionnez instance RAM:

source: Invalid selection
de: Ungültige Auswahl
fr: Sélection invalide

source: Row is too wide ({} bits)
de: Zeile ist zu lang ({} Bit)
fr: Rangée est trop large ({} bits)

source: Final memory layout:
de: Finales Speicherlayout:
fr: Disposition de la mémoire finale:

source: Memory layout width does not match required {} bits
de: Speicherlayoutbreite entspricht nicht den erforderlich {} Bit
fr: Largeur de la présentation de la mémoire ne correspond pas requis {} bits

source: Memory layout depth does not match required {} words
de: Speicherlayouttiefe entspricht nicht den erforderlich {} Worten
fr: Profondeur de Disposition de la mémoire ne correspond pas requis {} bits

source: Layout Spec:
de: Layout-Spezifikation:
fr: Disposition Spec:

source: Generated updated bit file:
de: Aktualisierte BIT-Datei wurde generiert:
fr: Généré fichier bit mise à jour:

source: Running data2mem...
de: Führe data2mem aus...
fr: data2mem exécuter...

source: data2mem failure
de: data2mem Abbruch
fr: échec data2mem

source: {}Row {}: {:4} - {:<4} {}
de: {}Zeile {}: {:4} - {:<4} {}
fr: {} Rangée: {} {:4} - {:<4} {}
